{
  "basics": {
    "name": "John Karabudak",
    "email": "hello@johnthenerd.com",
    "website": "johnthenerd.com",
    "location": {
      "region": "Newfoundland and Labrador",
      "country": "Canada"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "JohnTheNerd",
        "url": "https://github.com/JohnTheNerd"
      },
      {
        "network": "Hacker News",
        "username": "JohnTheNerd",
        "url": "https://news.ycombinator.com/user?id=JohnTheNerd"
      },
      {
        "network": "LinkedIn",
        "username": "john-karabudak",
        "url": "https://linkedin.com/in/john-karabudak"
      }
    ]
  },
  "work": [
    {
      "position": "Software Developer",
      "name": "WSP Environment & Infrastructure",
      "startDate": "2017-05",
      "highlights": [
        "Spearheaded our efforts to pay down technical debt efforts, decreasing our after-hours pages by over 50%.",
        "Optimized our weather portal performance, increasing our Google PageSpeed Insights score by 100%.",
        "Redesigned our data ingestion pipeline, achieving a 2000% improvement in processing times and reducing EC2 instance costs by 70%.",
        "Achieved over 10% savings in our group's AWS bill by using a combination of EC2 spot instances, AWS S3 Glacier Deep Archive, AWS Lambda, AWS VPC Endpoints, and other technologies.",
        "Championed the transformation of our operational security, introducing pivotal changes, including a complete overhaul of developer permissions and cultural changes promoting security as a priority.",
        "Orchestrated all technical aspects of the group's COVID-19 business continuity plan, ensuring uninterrupted operations during the pandemic.",
        "Known as a key crisis responder, adept at innovating immediate solutions in emergencies. Famously restored production operations within hours, even during AWS outages.",
        "Managed all technical and interpersonal aspects of a sophisticated meteorological system with hundreds of servers during a crucial inter-company carveout."
      ]
    }
  ],
  "education": [
    {
      "institution": "Memorial University of Newfoundland",
      "studyType": "Bachelor of Science (Computer Science)",
      "startDate": "2014-09",
      "endDate": "2020-09"
    }
  ],
  "projects": [
    {
      "name": "PySarra",
      "summary": "A Python client for Environment Canada's MQTT-based Sarracenia service that is designed to be easy to use.",
      "url": "https://github.com/JohnTheNerd/PySarra"
    },
    {
      "name": "serial2mqtt",
      "summary": "A Python microservice that streams LDJSON (Line-Delimited JSON) data from a serial port to a given MQTT broker.",
      "url": "https://github.com/JohnTheNerd/serial2mqtt"
    },
    {
      "name": "simple-gluster-ansible",
      "summary": "An Ansible playbook to install and configure GlusterFS that is designed to be simple, with TLS encryption pre-configured.",
      "url": "https://github.com/JohnTheNerd/simple-gluster-ansible"
    },
    {
      "name": "tarsnap-cron-docker",
      "summary": "A Docker container image that uses Tarsnap to periodically and automatically back up your data.",
      "url": "https://github.com/JohnTheNerd/tarsnap-cron-docker"
    },
    {
      "name": "TurtleTale",
      "summary": "A browser-based 2D platformer about a young turtle, complete with a level editor, an in-game shop, and toggleable cheats.",
      "url": "https://johnthenerd.com/?turtletale"
    },
    {
      "name": "WOLRelay",
      "summary": "A Python Wake-on-LAN forwarder that is able to listen for ARP reply packets to track IP addresses without any agent process running on the target machine.",
      "url": "https://github.com/JohnTheNerd/WOLRelay"
    }
  ]
}
